In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from pydataset import data
import acquire
import os

In [2]:
# get iris data

df_iris = data('iris')

In [3]:
# print first three rows

print(df_iris.head(3))

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
# print the number of rows and columns

print(df_iris.shape)

(150, 5)

In [5]:
# print the column names

print(list(df_iris.columns))

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [6]:
# print the data type of each column

print(df_iris.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB
None

In [7]:
# print the summary statistics for each of the numeric variables

print(df_iris.describe())

# Would you recommend rescaling the data based on these statistics?
# all measurements are in cm, if range was larger then scaling may be appropriate

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [8]:
df_train = pd.read_csv('/Users/robcasey/Desktop/train.csv')

In [9]:
# print the first 3 rows

df_train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [10]:
# print the number of rows and columns

print(df_train.shape)

(891, 12)

In [11]:
# print the column names

print(list(df_train.columns))

['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']

In [12]:
# print the data type of each column

df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
# print the summary statistics for each of the numeric variables

print(df_train.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [14]:
# print the unique values for each of your categorical variables

print(df_train.nunique())

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

Read the downloaded file into a dataframe named df_excel.

assign the first 100 rows to a new dataframe, df_excel_sample
print the number of rows of your original dataframe
print the first 5 column names
print the column names that have a data type of object
compute the range for each of the numeric variables.

In [15]:
# Read the downloaded file into a dataframe named df_excel

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_excel = pd.read_csv(csv_export_url)

In [16]:
# assign the first 100 rows to a new dataframe, df_excel_sample

df_excel_sample = df_excel.head(99)

In [17]:
# print the number of rows of your original dataframe

print(df_excel.shape)

(891, 12)

In [18]:
# print the first 5 column names

print(df_excel.columns[:5])

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex'], dtype='object')

In [19]:
df_excel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [20]:
# print the column names that have a data type of object

object_columns = df_excel.select_dtypes(include = ['object']).columns
object_columns

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [21]:
# compute the range for each of the numeric variables.

numeric_columns = df_excel.select_dtypes(include=['int64', 'float64']).columns
numeric_columns

# compute the range for each numeric column
excel_ranges = {}
for col in numeric_columns:
    excel_ranges[col] = df_excel[col].max() - df_excel[col].min()

# print the range for each numeric column
for col, r in excel_ranges.items():
    print(f"{col} range: {r}")

PassengerId range: 890
Survived range: 1
Pclass range: 2
Age range: 79.58
SibSp range: 8
Parch range: 6
Fare range: 512.3292

In [22]:
iris_df = acquire.get_iris_data()

In [23]:
iris_df.head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2

In [24]:
telco_df = acquire.get_telco_data()

In [25]:
telco_df.head()

,payment_type_id,internet_service_type_id,contract_type_id,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,...,tech_support,streaming_tv,streaming_movies,paperless_billing,monthly_charges,total_charges,churn,contract_type,internet_service_type,payment_type
0,2,1,2,0002-ORFBO,Female,0,Yes,Yes,9,Yes,...,Yes,Yes,No,Yes,65.6,593.3,No,One year,DSL,Mailed check
1,2,1,1,0003-MKNFE,Male,0,No,No,9,Yes,...,No,No,Yes,No,59.9,542.4,No,Month-to-month,DSL,Mailed check
2,1,2,1,0004-TLHLJ,Male,0,No,No,4,Yes,...,No,No,No,Yes,73.9,280.85,Yes,Month-to-month,Fiber optic,Electronic check
3,1,2,1,0011-IGKFF,Male,1,Yes,No,13,Yes,...,No,Yes,Yes,Yes,98.0,1237.85,Yes,Month-to-month,Fiber optic,Electronic check
4,2,2,1,0013-EXCHZ,Female,1,Yes,No,3,Yes,...,Yes,Yes,No,Yes,83.9,267.4,Yes,Month-to-month,Fiber optic,Mailed check

In [26]:
titanic_df = acquire.get_titanic_data()
titanic_df.head()

Reading from cached file.

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

## Preparation

Using the Iris Data:

Use the function defined in acquire.py to load the iris data.

Drop the species_id and measurement_id columns.

Rename the species_name column to just species.

Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

## Iris

In [27]:
import acquire as acq
iris_df = acq.get_iris_data()
iris_df.head()

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2

In [28]:
# review - since species is the thing being predicted, species_id isnt needed.
#        - When talking about a target, it may or may not need to be encoded.
#        - Depending on the type.

iris_df.drop(['species_id'], axis=1, inplace=True)
iris_df.head()

,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,setosa,1,5.1,3.5,1.4,0.2
1,setosa,2,4.9,3.0,1.4,0.2
2,setosa,3,4.7,3.2,1.3,0.2
3,setosa,4,4.6,3.1,1.5,0.2
4,setosa,5,5.0,3.6,1.4,0.2

In [29]:
iris_df.rename(columns={'species_name':'species'}, inplace=True)
iris_df.head()

,species,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,setosa,1,5.1,3.5,1.4,0.2
1,setosa,2,4.9,3.0,1.4,0.2
2,setosa,3,4.7,3.2,1.3,0.2
3,setosa,4,4.6,3.1,1.5,0.2
4,setosa,5,5.0,3.6,1.4,0.2

In [30]:
iris_df.drop(['measurement_id'], axis=1, inplace=True)

In [31]:
iris_dummy = pd.get_dummies(iris_df[['species']], drop_first=False)
iris_dummy.head()

   species_setosa  species_versicolor  species_virginica
0               1                   0                  0
1               1                   0                  0
2               1                   0                  0
3               1                   0                  0
4               1                   0                  0

Note: one-hot encoding not the best for target variable. Sometimes they need encoding, but we would generally need to keep them in a single series.

In [32]:
new_iris_df = pd.concat([iris_df, iris_dummy], axis=1)
new_iris_df.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

In [33]:
## review. 
# pd.concat([iris.]
#          pd.)

## review pd.crosstab(iris.species_id, iris.species_name)

In [34]:
def prep_iris(df):
    # args: iris, a single pandas dataframe
    # return: a cleaned single iris dataframe
    
    # Use the function defined in acquire.py to load the iris data
    import acquire as acq
    iris_df = acq.get_iris_data()
    
    # Drop the species_id and measurement_id columns
    iris_df.drop(['species_id'], axis=1, inplace=True)
    iris_df.drop(['measurement_id'], axis=1, inplace=True)
    
    # Rename the species_name column to just species
    iris_df.rename(columns={'species_name':'species'}, inplace=True)
    
    # Create dummy variables of the species name.
    iris_dummy = pd.get_dummies(iris_df[['species']], drop_first=False)
    new_iris = pd.concat([iris_df, iris_dummy], axis=1)
    
    return new_iris

In [35]:
iris = acq.get_iris_data()
iris = prep_iris(iris)
iris.head()

,species,sepal_length,sepal_width,petal_length,petal_width,species_setosa,species_versicolor,species_virginica
0,setosa,5.1,3.5,1.4,0.2,1,0,0
1,setosa,4.9,3.0,1.4,0.2,1,0,0
2,setosa,4.7,3.2,1.3,0.2,1,0,0
3,setosa,4.6,3.1,1.5,0.2,1,0,0
4,setosa,5.0,3.6,1.4,0.2,1,0,0

## Titanic

Use the function defined in acquire.py to load the Titanic data.

Drop any unnecessary, unhelpful, or duplicated columns.

Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

from sklearn. impute import simpleimputer
sklearn 101 process

want to use this with train set

my_imputer = simpleimputer

# make the thing
titanic_df
simpleimputer(strategy='mean')

# fit the thing
fit computes the mean inside of titanic's age and stores that value in the object
simpleimputer.fit(titanic[['age']])

# use the thing
transform will use that stored fit value to make any fills to our missing data
simpleimputer.transform(titanic[['age']])

In [36]:
titanic_df = acq.get_titanic_data()
titanic_df.head()

Reading from cached file.

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [37]:
titanic_df.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          2
class             0
deck            688
embark_town       2
alone             0
dtype: int64

In [38]:
titanic_not_null = titanic_df[titanic_df.embark_town.notnull()]
titanic_not_null.isnull().sum()

passenger_id      0
survived          0
pclass            0
sex               0
age             177
sibsp             0
parch             0
fare              0
embarked          0
class             0
deck            688
embark_town       0
alone             0
dtype: int64

In [39]:
titanic_not_null.drop(columns='deck', inplace=True)
titanic_not_null.head()

/var/folders/rb/x6d_9hp10qjb7n9jjvj0_jrm0000gn/T/ipykernel_23222/4017152815.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  titanic_not_null.drop(columns='deck', inplace=True)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1

In [40]:
titanic_dummy = pd.get_dummies(titanic_not_null[['embarked']], drop_first=False)
new_titanic = pd.concat([titanic_not_null, titanic_dummy], axis=1)

new_titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,embarked_C,embarked_Q,embarked_S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0,0,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,1,0,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0,0,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0,0,1
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0,0,1

In [41]:
list(new_titanic.columns)

['passenger_id',
 'survived',
 'pclass',
 'sex',
 'age',
 'sibsp',
 'parch',
 'fare',
 'embarked',
 'class',
 'embark_town',
 'alone',
 'embarked_C',
 'embarked_Q',
 'embarked_S']

In [42]:
from sklearn.model_selection import train_test_split

train_validate, test = train_test_split(new_titanic, test_size=.2,
                                       random_state=123,
                                       stratify=new_titanic.survived)
train_validate.shape, test.shape

((711, 15), (178, 15))

In [43]:
train, validate = train_test_split(train_validate, test_size=.3, 
                                   random_state=123, 
                                   stratify=train_validate.survived)
train.shape, validate.shape

((497, 15), (214, 15))

In [44]:
import warnings
warnings.filterwarnings("ignore")

from sklearn.impute import SimpleImputer

my_strategy = 'mean'
column_list = ['age']

def impute(train, validate, test, my_strategy, column_list):
    imputer = SimpleImputer(strategy=my_strategy)
    train[column_list] = imputer.fit_transform(train[column_list])
    validate[column_list] = imputer.transform(validate[column_list])
    test[column_list] = imputer.transform(test[column_list])
    return train, validate, test

In [45]:
type(new_titanic)

pandas.core.frame.DataFrame

In [46]:
import prepare as prep
prep.titanic_split()

Reading from cached file.

(     passenger_id  survived  pclass     sex   age  sibsp  parch      fare  \
 583           583         0       1    male  36.0      0      0   40.1250
 165           165         1       3    male   9.0      0      2   20.5250
 50             50         0       3    male   7.0      4      1   39.6875
 259           259         1       2  female  50.0      0      1   26.0000
 306           306         1       1  female   NaN      0      0  110.8833
 ..            ...       ...     ...     ...   ...    ...    ...       ...
 313           313         0       3    male  28.0      0      0    7.8958
 636           636         0       3    male  32.0      0      0    7.9250
 222           222         0       3    male  51.0      0      0    8.0500
 485           485         0       3  female   NaN      3      1   25.4667
 744           744         1       3    male  31.0      0      0    7.9250

     embarked   class deck  embark_town  alone
 583        C   First    A    Cherbourg      1
 165        S   Third  NaN  Southampton      0
 50         S   Third  NaN  Southampton      0
 259        S  Second  NaN  Southampton      0
 306        C   First  NaN    Cherbourg      1
 ..       ...     ...  ...          ...    ...
 313        S   Third  NaN  Southampton      1
 636        S   Third  NaN  Southampton      1
 222        S   Third  NaN  Southampton      1
 485        S   Third  NaN  Southampton      0
 744        S   Third  NaN  Southampton      1

 [498 rows x 13 columns],
      passenger_id  survived  pclass     sex   age  sibsp  parch      fare  \
 610           610         0       3  female  39.0      1      5   31.2750
 424           424         0       3    male  18.0      1      1   20.2125
 568           568         0       3    male   NaN      0      0    7.2292
 334           334         1       1  female   NaN      1      0  133.6500
 101           101         0       3    male   NaN      0      0    7.8958
 ..            ...       ...     ...     ...   ...    ...    ...       ...
 176           176         0       3    male   NaN      3      1   25.4667
 372           372         0       3    male  19.0      0      0    8.0500
 737           737         1       1    male  35.0      0      0  512.3292
 862           862         1       1  female  48.0      0      0   25.9292
 26             26         0       3    male   NaN      0      0    7.2250

     embarked  class deck  embark_town  alone
 610        S  Third  NaN  Southampton      0
 424        S  Third  NaN  Southampton      0
 568        C  Third  NaN    Cherbourg      1
 334        S  First  NaN  Southampton      0
 101        S  Third  NaN  Southampton      1
 ..       ...    ...  ...          ...    ...
 176        S  Third  NaN  Southampton      0
 372        S  Third  NaN  Southampton      1
 737        C  First    B    Cherbourg      1
 862        S  First    D  Southampton      1
 26         C  Third  NaN    Cherbourg      1

 [214 rows x 13 columns],
      passenger_id  survived  pclass     sex   age  sibsp  parch      fare  \
 561           561         0       3    male  40.0      0      0    7.8958
 641           641         1       1  female  24.0      0      0   69.3000
 400           400         1       3    male  39.0      0      0    7.9250
 498           498         0       1  female  25.0      1      2  151.5500
 875           875         1       3  female  15.0      0      0    7.2250
 ..            ...       ...     ...     ...   ...    ...    ...       ...
 339           339         0       1    male  45.0      0      0   35.5000
 841           841         0       2    male  16.0      0      0   10.5000
 442           442         0       3    male  25.0      1      0    7.7750
 815           815         0       1    male   NaN      0      0    0.0000
 53             53         1       2  female  29.0      1      0   26.0000

     embarked   class deck  embark_town  alone
 561        S   Third  NaN  Southampton      1
 641        C   First    B    Cherbourg      1
 400        S   Third  NaN  Southampton      1
 498        S   First    C  Southampton      0
 875        C   Third  NaN    Cherbourg      1
 ..       ...     ...  ...          ...    ...
 339        S   First  NaN  Southampton      1
 841        S  Second  NaN  Southampton      1
 442        S   Third  NaN  Southampton      0
 815        S   First    B  Southampton      1
 53         S  Second  NaN  Southampton      0

 [179 rows x 13 columns])

In [47]:
titanic_train, titanic_validate, titanic_test = impute(train, validate, test, my_strategy, column_list)
titanic_train.info()
titanic_validate.info()
titanic_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 497 entries, 583 to 553
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  497 non-null    int64
 1   survived      497 non-null    int64
 2   pclass        497 non-null    int64
 3   sex           497 non-null    object
 4   age           497 non-null    float64
 5   sibsp         497 non-null    int64
 6   parch         497 non-null    int64
 7   fare          497 non-null    float64
 8   embarked      497 non-null    object
 9   class         497 non-null    object
 10  embark_town   497 non-null    object
 11  alone         497 non-null    int64
 12  embarked_C    497 non-null    uint8
 13  embarked_Q    497 non-null    uint8
 14  embarked_S    497 non-null    uint8
dtypes: float64(2), int64(6), object(4), uint8(3)
memory usage: 51.9+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 214 entries, 610 to 26
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  214 non-null    int64
 1   survived      214 non-null    int64
 2   pclass        214 non-null    int64
 3   sex           214 non-null    object
 4   age           214 non-null    float64
 5   sibsp         214 non-null    int64
 6   parch         214 non-null    int64
 7   fare          214 non-null    float64
 8   embarked      214 non-null    object
 9   class         214 non-null    object
 10  embark_town   214 non-null    object
 11  alone         214 non-null    int64
 12  embarked_C    214 non-null    uint8
 13  embarked_Q    214 non-null    uint8
 14  embarked_S    214 non-null    uint8
dtypes: float64(2), int64(6), object(4), uint8(3)
memory usage: 22.4+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 178 entries, 561 to 809
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  178 non-null    int64
 1   survived      178 non-null    int64
 2   pclass        178 non-null    int64
 3   sex           178 non-null    object
 4   age           178 non-null    float64
 5   sibsp         178 non-null    int64
 6   parch         178 non-null    int64
 7   fare          178 non-null    float64
 8   embarked      178 non-null    object
 9   class         178 non-null    object
 10  embark_town   178 non-null    object
 11  alone         178 non-null    int64
 12  embarked_C    178 non-null    uint8
 13  embarked_Q    178 non-null    uint8
 14  embarked_S    178 non-null    uint8
dtypes: float64(2), int64(6), object(4), uint8(3)
memory usage: 18.6+ KB

## Telco

In [48]:
telco_df.head().T

,0,1,2,3,4
payment_type_id,2,2,1,1,2
internet_service_type_id,1,1,2,2,2
contract_type_id,2,1,1,1,1
customer_id,0002-ORFBO,0003-MKNFE,0004-TLHLJ,0011-IGKFF,0013-EXCHZ
gender,Female,Male,Male,Male,Female
senior_citizen,0,0,0,1,1
partner,Yes,No,No,Yes,Yes
dependents,Yes,No,No,No,No
tenure,9,9,4,13,3
phone_service,Yes,Yes,Yes,Yes,Yes
multiple_lines,No,Yes,No,No,No
online_security,No,No,No,No,No
online_backup,Yes,No,No,Yes,No
device_protection,No,No,Yes,Yes,No
tech_support,Yes,No,No,No,Yes
streaming_tv,Yes,No,No,Yes,Yes
streaming_movies,No,Yes,No,Yes,No
paperless_billing,Yes,No,Yes,Yes,Yes
monthly_charges,65.6,59.9,73.9,98.0,83.9
total_charges,593.3,542.4,280.85,1237.85,267.4
churn,No,No,Yes,Yes,Yes
contract_type,One year,Month-to-month,Month-to-month,Month-to-month,Month-to-month
internet_service_type,DSL,DSL,Fiber optic,Fiber optic,Fiber optic
payment_type,Mailed check,Mailed check,Electronic check,Electronic check,Mailed check

In [49]:
telco_df.shape

(7043, 24)

In [50]:
telco_df.drop_duplicates(inplace=True)

In [51]:
telco_df.shape

(7043, 24)

In [52]:
drop_columns = ['payment_type_id', 'internet_service_type_id', \
               'contract_type_id', 'customer_id']

In [53]:
telco_df.drop(columns=drop_columns, inplace=True)

In [54]:
telco_df.head().T

,0,1,2,3,4
gender,Female,Male,Male,Male,Female
senior_citizen,0,0,0,1,1
partner,Yes,No,No,Yes,Yes
dependents,Yes,No,No,No,No
tenure,9,9,4,13,3
phone_service,Yes,Yes,Yes,Yes,Yes
multiple_lines,No,Yes,No,No,No
online_security,No,No,No,No,No
online_backup,Yes,No,No,Yes,No
device_protection,No,No,Yes,Yes,No
tech_support,Yes,No,No,No,Yes
streaming_tv,Yes,No,No,Yes,Yes
streaming_movies,No,Yes,No,Yes,No
paperless_billing,Yes,No,Yes,Yes,Yes
monthly_charges,65.6,59.9,73.9,98.0,83.9
total_charges,593.3,542.4,280.85,1237.85,267.4
churn,No,No,Yes,Yes,Yes
contract_type,One year,Month-to-month,Month-to-month,Month-to-month,Month-to-month
internet_service_type,DSL,DSL,Fiber optic,Fiber optic,Fiber optic
payment_type,Mailed check,Mailed check,Electronic check,Electronic check,Mailed check

In [55]:
# list columns
catcol = [col for col in telco_df.columns if telco_df[col].dtype == 'O']

In [56]:
catcol

['gender',
 'partner',
 'dependents',
 'phone_service',
 'multiple_lines',
 'online_security',
 'online_backup',
 'device_protection',
 'tech_support',
 'streaming_tv',
 'streaming_movies',
 'paperless_billing',
 'total_charges',
 'churn',
 'contract_type',
 'internet_service_type',
 'payment_type']

In [57]:
# Encode Categorical Columns

dummy_df = pd.get_dummies(telco_df[catcol], dummy_na=False, drop_first=[True, True])
dummy_df

,gender_Male,partner_Yes,dependents_Yes,phone_service_Yes,multiple_lines_No phone service,multiple_lines_Yes,online_security_No internet service,online_security_Yes,online_backup_No internet service,online_backup_Yes,...,total_charges_999.8,total_charges_999.9,churn_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,0,1,1,1,0,0,0,0,0,1,...,0,0,0,1,0,0,0,0,0,1
1,1,0,0,1,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1
2,1,0,0,1,0,0,0,0,0,0,...,0,0,1,0,0,1,0,0,1,0
3,1,1,0,1,0,0,0,0,0,1,...,0,0,1,0,0,1,0,0,1,0
4,0,1,0,1,0,0,0,0,0,0,...,0,0,1,0,0,1,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,0,0,0,1,0,0,0,1,0,0,...,0,0,0,1,0,0,0,0,0,1
7039,1,1,0,1,0,1,0,0,0,0,...,0,0,1,0,0,1,0,0,1,0
7040,1,0,0,1,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,1
7041,1,1,1,1,0,0,0,1,0,0,...,0,0,0,0,1,0,0,0,0,1
7042,1,1,1,0,1,0,0,1,0,1,...,0,0,0,0,1,0,0,0,1,0

In [58]:
telco_df = pd.concat([telco_df, dummy_df], axis=1)
telco_df.head()

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,...,total_charges_999.8,total_charges_999.9,churn_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,...,0,0,0,1,0,0,0,0,0,1
1,Male,0,No,No,9,Yes,Yes,No,No,No,...,0,0,0,0,0,0,0,0,0,1
2,Male,0,No,No,4,Yes,No,No,No,Yes,...,0,0,1,0,0,1,0,0,1,0
3,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,...,0,0,1,0,0,1,0,0,1,0
4,Female,1,Yes,No,3,Yes,No,No,No,No,...,0,0,1,0,0,1,0,0,0,1

In [59]:
telco_df.shape

(7043, 6577)

In [60]:
prep.prep_telco(acquire.get_telco_data())

,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,online_security,online_backup,device_protection,...,streaming_movies_Yes,paperless_billing_Yes,churn_Yes,contract_type_One year,contract_type_Two year,internet_service_type_Fiber optic,internet_service_type_None,payment_type_Credit card (automatic),payment_type_Electronic check,payment_type_Mailed check
0,Female,0,Yes,Yes,9,Yes,No,No,Yes,No,...,0,1,0,1,0,0,0,0,0,1
1,Male,0,No,No,9,Yes,Yes,No,No,No,...,1,0,0,0,0,0,0,0,0,1
2,Male,0,No,No,4,Yes,No,No,No,Yes,...,0,1,1,0,0,1,0,0,1,0
3,Male,1,Yes,No,13,Yes,No,No,Yes,Yes,...,1,1,1,0,0,1,0,0,1,0
4,Female,1,Yes,No,3,Yes,No,No,No,No,...,0,1,1,0,0,1,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,Female,0,No,No,13,Yes,No,Yes,No,No,...,0,0,0,1,0,0,0,0,0,1
7039,Male,0,Yes,No,22,Yes,Yes,No,No,No,...,1,1,1,0,0,1,0,0,1,0
7040,Male,0,No,No,2,Yes,No,No,Yes,No,...,0,1,0,0,0,0,0,0,0,1
7041,Male,0,Yes,Yes,67,Yes,No,Yes,No,Yes,...,1,0,0,0,1,0,0,0,0,1
7042,Male,0,Yes,Yes,63,No,No phone service,Yes,Yes,Yes,...,1,0,0,0,1,0,0,0,1,0

Return and Review

# Split the data
1. Write a function to split the data into train, validate and test datasets.
2. Add this function into prepare.py

In [61]:
telco_prepared = prep.prep_telco(acquire.get_telco_data())
telco_prepared.head().T

,0,1,2,3,4
gender,Female,Male,Male,Male,Female
senior_citizen,0,0,0,1,1
partner,Yes,No,No,Yes,Yes
dependents,Yes,No,No,No,No
tenure,9,9,4,13,3
phone_service,Yes,Yes,Yes,Yes,Yes
multiple_lines,No,Yes,No,No,No
online_security,No,No,No,No,No
online_backup,Yes,No,No,Yes,No
device_protection,No,No,Yes,Yes,No
tech_support,Yes,No,No,No,Yes
streaming_tv,Yes,No,No,Yes,Yes
streaming_movies,No,Yes,No,Yes,No
paperless_billing,Yes,No,Yes,Yes,Yes
monthly_charges,65.6,59.9,73.9,98.0,83.9
total_charges,593.3,542.4,280.85,1237.85,267.4
churn,No,No,Yes,Yes,Yes
contract_type,One year,Month-to-month,Month-to-month,Month-to-month,Month-to-month
internet_service_type,DSL,DSL,Fiber optic,Fiber optic,Fiber optic
payment_type,Mailed check,Mailed check,Electronic check,Electronic check,Mailed check
gender_Male,0,1,1,1,0
partner_Yes,1,0,0,1,1
dependents_Yes,1,0,0,0,0
phone_service_Yes,1,1,1,1,1
multiple_lines_No phone service,0,0,0,0,0
multiple_lines_Yes,0,1,0,0,0
online_security_No internet service,0,0,0,0,0
online_security_Yes,0,0,0,0,0
online_backup_No internet service,0,0,0,0,0
online_backup_Yes,1,0,0,1,0
device_protection_No internet service,0,0,0,0,0
device_protection_Yes,0,0,1,1,0
tech_support_No internet service,0,0,0,0,0
tech_support_Yes,1,0,0,0,1
streaming_tv_No internet service,0,0,0,0,0
streaming_tv_Yes,1,0,0,1,1
streaming_movies_No internet service,0,0,0,0,0
streaming_movies_Yes,0,1,0,1,0
paperless_billing_Yes,1,0,1,1,1
churn_Yes,0,0,1,1,1
contract_type_One year,1,0,0,0,0
contract_type_Two year,0,0,0,0,0
internet_service_type_Fiber optic,0,0,1,1,1
internet_service_type_None,0,0,0,0,0
payment_type_Credit card (automatic),0,0,0,0,0
payment_type_Electronic check,0,0,1,1,0
payment_type_Mailed check,1,1,0,0,1

# Exploration
1. Use the iris dataset. Split data into train, test and validate samples.

In [62]:
from sklearn.model_selection import train_test_split

In [69]:
train_validate, test = train_test_split(iris, test_size=.2,
                                       random_state=123,
                                       stratify=iris.species)
train_validate.shape, test.shape

((120, 8), (30, 8))

In [70]:
train, validate = train_test_split(train_validate, test_size=.3, 
                                   random_state=123, 
                                   stratify=train_validate.species)
train.shape, validate.shape

((84, 8), (36, 8))

In [72]:
iris_train = train
iris_validate = validate
iris_test = test

In [75]:
iris_train.info()
iris_validate.info()
iris_test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 84 entries, 79 to 73
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   species             84 non-null     object
 1   sepal_length        84 non-null     float64
 2   sepal_width         84 non-null     float64
 3   petal_length        84 non-null     float64
 4   petal_width         84 non-null     float64
 5   species_setosa      84 non-null     uint8
 6   species_versicolor  84 non-null     uint8
 7   species_virginica   84 non-null     uint8
dtypes: float64(4), object(1), uint8(3)
memory usage: 4.2+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 36 entries, 134 to 124
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   species             36 non-null     object
 1   sepal_length        36 non-null     float64
 2   sepal_width         36 non-null     float64
 3   petal_length        36 non-null     float64
 4   petal_width         36 non-null     float64
 5   species_setosa      36 non-null     uint8
 6   species_versicolor  36 non-null     uint8
 7   species_virginica   36 non-null     uint8
dtypes: float64(4), object(1), uint8(3)
memory usage: 1.8+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 30 entries, 80 to 65
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   species             30 non-null     object
 1   sepal_length        30 non-null     float64
 2   sepal_width         30 non-null     float64
 3   petal_length        30 non-null     float64
 4   petal_width         30 non-null     float64
 5   species_setosa      30 non-null     uint8
 6   species_versicolor  30 non-null     uint8
 7   species_virginica   30 non-null     uint8
dtypes: float64(4), object(1), uint8(3)
memory usage: 1.5+ KB

Create a swarmplot using a melted dataframe of all your numeric variables. 

The x-axis should be the variable name, the y-axis is the measure. 

Add another dimension using color to represent species. 

Document takeaways from this visualization.

In [76]:
# melted dataframe
iris_train_melt = iris_train.melt(id_vars='species', var_name='feature', value_name='measurement')

#swarmplot
plt.figure(figsize)